Amiya200/stm32_water_tank/Core/Src/model_handle.c
    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;

    /* If ON == OFF → treat as disabled */
    if (on == off)
        return false;

    /* Normal same-day slot */
    if (on < off)
        return (now >= on && now < off);

    /* Overnight slot */
    return (now >= on || now < off);
}


static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}
static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;

    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();
    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;
        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;
        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);
        if (active)
            return t->gapMinutes;
    }
    return 0;
}
static uint32_t timer_get_gap_ms(void)
{
    uint16_t gapMin = get_active_timer_gap_minutes();

    if (gapMin == 0)
        return 0;

    return (uint32_t)gapMin * 60UL * 1000UL;
}
void ModelHandle_ProcessTimerSlots(void)
{
    uint32_t now = HAL_GetTick();
    bool slotActive = timer_any_active_slot();

    /* ================================
       TIMER START EVENT
       ================================ */
    if (!timerActive && slotActive)
    {
        backup_current_mode();
        clear_all_modes();

        timerActive = true;
        motorOwner  = MOTOR_OWNER_TIMER;

        timerState = TIMER_STATE_ON;
        timerStateDeadline = 0;   // force initialization
    }

    /* ================================
       TIMER STOP EVENT
       ================================ */
    if (timerActive && !slotActive)
    {
        stop_motor();
        timerActive = false;

        timerState = TIMER_STATE_ON;
        timerStateDeadline = 0;

        restore_previous_mode();

        previousOwner     = MOTOR_OWNER_NONE;
        previousManual    = false;
        previousSemi      = false;
        previousCountdown = false;
        previousAuto      = false;

        ModelHandle_SaveModeState();
        return;
    }

    if (!timerActive)
        return;

    /* ================================
       TANK FULL PROTECTION
       ================================ */
    if (isTankFull())
    {
        stop_motor();
        return;
    }

    uint32_t gapMs = timer_get_gap_ms();

    /* ================================
       CONTINUOUS MODE (gap = 0)
       ================================ */
    if (gapMs == 0)
    {
        ModelHandle_CheckDryRun();

        if (senseDryRun)
        {
            if (!Motor_GetStatus())
            {
                motorOwner = MOTOR_OWNER_TIMER;
                start_motor();
            }
        }
        else
        {
            if (Motor_GetStatus())
                stop_motor();
        }
        return;
    }

    /* ================================
       GAP BASED STATE MACHINE
       (Smooth Transition Version)
       ================================ */

    /* First-time initialization */
    if (timerStateDeadline == 0)
    {
        timerStateDeadline = now + gapMs;

        if (timerState == TIMER_STATE_ON)
        {
            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();
        }
        else
        {
            stop_motor();
        }
    }

    switch (timerState)
    {
        /* ============================
           ON PHASE
           ============================ */
        case TIMER_STATE_ON:
        {
            /* Only act when duration completed */
            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;

                stop_motor();   // called once on transition
            }
        }
        break;

        /* ============================
           OFF PHASE
           ============================ */
        case TIMER_STATE_OFF:
        {
            if (now >= timerStateDeadline)
            {
                ModelHandle_CheckDryRun();

                if (senseDryRun)   // water available
                {
                    timerState = TIMER_STATE_ON;
                    timerStateDeadline = now + gapMs;

                    motorOwner = MOTOR_OWNER_TIMER;
                    start_motor();  // called once on transition
                }
                else
                {
                    /* Stay OFF and wait another OFF duration */
                    timerStateDeadline = now + gapMs;
                }
            }
        }
        break;

        default:
        {
            timerState = TIMER_STATE_ON;
            timerStateDeadline = now + gapMs;

            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();
        }
        break;
    }
}

void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner = MOTOR_OWNER_SEMIAUTO;
    senseDryRun = false;
    if (!isTankFull())
        start_motor();
}
void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();
    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;
    ModelHandle_SaveModeState();
    start_motor();
    autoDeadline = now_ms() + gap_s * 1000UL;
}
void ModelHandle_StopAuto(void)
{
	stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME, (uint8_t[]){0}, sizeof(AutoRuntimeBlock));
    ModelHandle_SaveModeState();
}
void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    AutoRuntimeBlock b;
    EEPROM_ReadBuffer(EE_ADDR_AUTO_RUNTIME,(uint8_t*)&b,sizeof(b));
    if(b.sig != AUTO_SIG) return;
    if(AUTO_CRC((uint8_t*)&b,sizeof(b)-1) != b.crc) return;
    if(!b.active) return;
    autoActive       = true;
    autoState        = (AutoState)b.state;
    auto_retry_count = b.retryCount;
    autoDeadline     = now_ms() + b.remaining_ms;
    autoResumeBoot   = true;
    start_motor();
}
static uint8_t get_tank_level_percent(void)
{
    uint8_t submerged = 0;

    for (int i = 0; i <= 3; i++)
    {
        if (adcData.voltages[i] < 0.10f)
            submerged++;
    }

